package dev.sixik.unigui.api.layout;

/**
 * Порядок автораскладки элементов грида без явных позиций.
 */
public enum GridAutoFlow {
    /**
     * Заполняет строки по порядку, создавая неявные строки по мере нужды.
     */
    ROW,
    /**
     * Заполняет колонки по порядку, создавая неявные колонки по мере нужды.
     */
    COLUMN,
    /**
     * Построчный порядок с заполнением пустот от объединяющих элементов.
     */
    ROW_DENSE,
    /**
     * Поколоночный порядок с заполнением пустот от объединяющих элементов.
     */
    COLUMN_DENSE
}
