package dev.sixik.unigui.api.layout;

public enum Justify {
    /**
     * Выравнивает или размещает значение в начале доступной области.
     */
    START,
    /**
     * Выравнивает или размещает значение по центру доступной области.
     */
    CENTER,
    /**
     * Выравнивает или размещает значение в конце доступной области.
     */
    END,
    /**
     * Распределяет свободное место между элементами, без отступов по краям.
     */
    SPACE_BETWEEN,
    /**
     * Распределяет свободное место вокруг элементов, по половине отступа по краям.
     */
    SPACE_AROUND,
    /**
     * Распределяет свободное место равномерно вокруг элементов, с полными отступами по краям.
     */
    SPACE_EVENLY
}
